export const questionPools: string[] = [
    "請列出3位台灣總統",
    "請列出3種球類運動",
    "請列出3種金屬元素",
    "請列出3種職業",
    "請列出3種化妝品品牌",
    "請列出3位聖經人數",
    "請列出3本福音書",
    "請列出3種情緒",
    "請列出3種顏色",
    "請列出3種國家",
    "請列出3種夜市小吃",
    "請列出3個韓劇",
    "請列出3部電影",
    "請列出3種啟發課程主題",
    "請列出3種髮型",
    "請列出3種台灣品牌",
    "請列出3間學校",
    "請列出3種車型",
    "請列出3種調味料",
    "請列出3種麵包",
    "請列出3種卡通人物",
    "請列出3種天災",
    "請列出3種肉食性動物",
    "請列出3個世界七大奇景",
    "請列出3個星球",
    "請列出3種星座",
    "請列出3種疾病",
    "請列出3個建築物",
    "請列出3種手機廠商",
    "請列出3種科技",
    "請列出3種超商商品",
    "請列出3種稅",
    "請列出3種奧運項目",
    "請列出3位藝人",
    "請列出3種才藝",
    "請列出3種布料材質",
    "請列出3種糕點",
    "請列出3種生魚片",
    "請列出3種手搖飲",
    "請列出3種語言",
    "請列出3種節慶",
    "請列出3本翻譯小說",
    "請列出3種文具",
    "請列出3種廚具",
    "請列出3種餐具",
    "請列出3種顏料",
];

// declare the function 
export const shuffle = (array: string[]) => {
    for (let i = array.length - 1; i > 0; i--) {
        const j = Math.floor(Math.random() * (i + 1));
        [array[i], array[j]] = [array[j], array[i]];
    }
    return array;
}; 